blockMeshDict/Draft Tube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// blockMeshDict for Draft Tube
convertToMeters 1;

R 0.5; // Radius of Pipe
r 2; // Radius of bend
L 5; // Length of draft tube
l 2; //cross section of draft
b 1; //cross section of draft
cell #calc "$R*30";
ccell #calc "$r*50";
lcell #calc "$L*50";

radAngle #calc "degToRad(45)";  //convert angle to radians
C #calc "$R*sin($radAngle)";   //Point in curve R sin angle
r1 #calc "$r+$R";
r2 #calc "$r-$R";
b1 #calc "0.5*$b";
p1 #calc "$r1*sin($radAngle)";
p2 #calc "$r*sin($radAngle)";
p3 #calc "$r2*sin($radAngle)";

vertices
(
    (#calc "-1.0*$R" 0 0)
    (0 #calc "-1.0*$R" 0)
    ($R 0 0)
    (0 $R 0)

    ($r 0 $r1)
    ($r #calc "-1.0*$R" $r)
    ($r 0 $r2)
    ($r $R $r)

    ($L #calc "-0.5*$l" #calc "$r+$b1")
    ($L #calc "-0.5*$l" #calc "$r-$b1")
    ($L #calc "0.5*$l" #calc "$r-$b1")
    ($L #calc "0.5*$l" #calc "$r+$b1")
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cell $cell $ccell) simpleGrading (1 1 1)
    hex (5 9 10 6 4 8 11 7) ($lcell $cell $cell) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (#calc "-1.0*$C" #calc "-1.0*$C" 0)
    arc 1 2 ($C #calc "-1.0*$C" 0)
    arc 2 3 ($C $C 0)
    arc 3 0 (#calc "-1.0*$C" $C 0)

    arc 4 5 ($r #calc "-1.0*$C" #calc "$r+$C")
    arc 5 6 ($r #calc "-1.0*$C" #calc "$r-$C")
    arc 6 7 ($r $C #calc "$r-$C")
    arc 7 4 ($r $C #calc "$r+$C")

    arc 0 4 (#calc "$r-$p1" 0 $p1)
    arc 1 5 (#calc "$r-$p2" #calc "-1.0*$R" $p2)
    arc 2 6 (#calc "$r-$p3" 0 $p3)
    arc 3 7 (#calc "$r-$p2" $R $p2)
);

boundary
(    
    Walls
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (2 3 7 6)
            (0 3 7 4)
            (0 1 5 4)
            (5 9 10 6)
            (6 10 11 7)
            (7 11 8 4)
            (4 8 9 5)
        );
    }
    Inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    Outlet
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
